Show / Hide Table of Contents
Class CoordSystemByPoint
Coordinates system defid by the point and the plane
Inheritance
System.Object
OpenObject
CoordSystem
CoordSystemByPoint
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.CoordSystemByPoint,CI.Geometry3D")]
public class CoordSystemByPoint : CoordSystem
Properties
Improve this Doc   View Source
InPlane
Point is in Plane
Declaration
public Plane InPlane { get; set; }
Property Value
 Type |  Description
 Plane
Improve this Doc   View Source
Point
Point where Y o Z axis is located
Declaration
public Point3D Point { get; set; }
Property Value
 Type |  Description
 Point3D
 Improve this Doc
 View Source